{
  "num_sentences": 23,
  "images_downloaded": [
    "inhabitants_1.jpg",
    "abilities_1.jpg",
    "amoeba_1.jpg",
    "power_1.jpg",
    "pseudopodia_1.jpg",
    "movement_1.jpg",
    "inhabitants_1.jpg",
    "abilities_1.jpg",
    "amoeba_1.jpg",
    "power_1.jpg",
    "pseudopodia_1.jpg",
    "movement_1.jpg",
    "time_1.jpg",
    "kingdom_1.jpg",
    "microorganism_1.jpg",
    "pseudopodia_1.jpg",
    "inhabitants_1.jpg",
    "abilities_1.jpg",
    "amoeba_1.jpg",
    "power_1.jpg",
    "pseudopodia_1.jpg",
    "movement_1.jpg",
    "day_1.jpg",
    "crystal_1.jpg",
    "pseudopodia_1.jpg",
    "source_1.jpg",
    "pseudopodia_1.jpg",
    "creatures_1.jpg",
    "bubble_1.jpg",
    "juices_1.jpg",
    "food_1.jpg",
    "vacuole_1.jpg",
    "organisms_1.jpg",
    "pseudopodia_1.jpg",
    "adventures_1.jpg",
    "beings_1.jpg",
    "creatures_1.jpg",
    "cellulose_1.jpg",
    "tales_1.jpg",
    "pseudopodia_1.jpg",
    "microorganisms_1.jpg",
    "corners_1.jpg",
    "kingdom_1.jpg",
    "figure_1.jpg",
    "world_1.jpg",
    "magic_1.jpg"
  ],
  "input_texts": [
    "In Microterra, the inhabitants were unique, each having their own special abilities.",
    "Amara, being an amoeba, had the extraordinary power of creating pseudopodia at will.",
    "These pseudopodia were not just for movement; they could also conjure delicious meals.",
    "\n\r\nIn Microterra, the inhabitants were unique, each having their own special abilities.",
    "Amara, being an amoeba, had the extraordinary power of creating pseudopodia at will.",
    "These pseudopodia were not just for movement; they could also conjure delicious meals.",
    "\n\r\nOnce upon a time in a microscopic kingdom called Microterra, there lived a tiny and lively creature named Amara the Amoeba.",
    "Amara was no ordinary microorganism; she possessed magical pseudopodia that allowed her to explore the vast world of her microscopic realm.",
    "\n\r\nIn Microterra, the inhabitants were unique, each having their own special abilities.",
    "Amara, being an amoeba, had the extraordinary power of creating pseudopodia at will.",
    "These pseudopodia were not just for movement; they could also conjure delicious meals.",
    "\n\r\nOne day, as Amara was gracefully gliding through the crystal-clear waters of Microterra, she sensed a delectable aroma wafting through the microscopic currents.",
    "Intrigued, she extended her magical pseudopodia towards the source of the scent and discovered a banquet of microscopic organisms.",
    "\n\r\nAmara, with her incredible pseudopodia, gently surrounded the tiny creatures, creating a magical bubble known as a food vacuole.",
    "Inside this enchanted bubble, Amara's digestive juices, as sparkly as fairy dust, began their magical dance on the captured feast.",
    "\n\r\nThe food vacuole transformed into a mesmerizing kaleidoscope of colors as the digestion process unfolded.",
    "The microscopic organisms surrendered to the magical pseudopodia, breaking down into simpler substances that Amara's tiny kingdom needed for growth and prosperity.",
    "\n\r\nAs Amara continued her culinary adventures, the other microscopic beings marveled at her unique abilities.",
    "Some creatures in Microterra, like the wise Ruminara the Ruminant, with her cellulose-digesting magic, would occasionally join Amara in her enchanting feasts.",
    "\n\r\nThe tales of Amara's magical pseudopodia spread far and wide in Microterra, turning her into a legendary figure.",
    "Microorganisms from all corners of the kingdom sought her guidance on the art of feeding and digestion.",
    "\n\r\nAnd so, in the microscopic kingdom of Microterra, Amara the Amoeba became a beloved figure, known for her enchanting pseudopodia that not only moved gracefully but also conjured magical banquets, bringing joy and vitality to all the tiny inhabitants.",
    "And the microscopic world continued to thrive with the magic of digestion and the whimsical wonders of its extraordinary residents."
  ]
}