{
  "num_sentences": 20,
  "images_downloaded": [
    "time_1.jpg",
    "town_1.jpg",
    "beings_1.jpg",
    "quest_1.jpg",
    "heart_1.jpg",
    "tree_1.jpg",
    "tree_1.jpg",
    "adventure_1.jpg",
    "morning_1.jpg",
    "journey_1.jpg",
    "group_1.jpg",
    "teeth_1.jpg",
    "dance_1.jpg",
    "mastication_1.jpg",
    "journey_1.jpg",
    "hydrochloric_1.jpg",
    "proteins_1.jpg",
    "substances_1.jpg",
    "place_1.jpg",
    "thousands_1.jpg",
    "villi_1.jpg",
    "surface_1.jpg",
    "water_1.jpg",
    "salts_1.jpg",
    "waste_1.jpg",
    "faeces_1.jpg",
    "adventure_1.jpg",
    "end_1.jpg",
    "ruminants_1.jpg",
    "process_1.jpg",
    "verse_1.jpg",
    "reached_1.jpg",
    "couple_1.jpg",
    "importance_1.jpg",
    "journey_1.jpg",
    "adventure_1.jpg",
    "verse_1.jpg",
    "story_1.jpg",
    "knowledge_1.jpg",
    "fun_1.jpg"
  ],
  "input_texts": [
    "Once upon a time, in a lively town named Nutriville, there lived a curious group of creatures known as the NutriPals.",
    "These colorful beings were on a quest to learn the secrets of nutrition and the magical journey that food takes within their own Nutri-verse.",
    "\n\r\nIn the heart of Nutriville stood the Great DigestoTree, a magnificent tree with branches that stretched high into the sky.",
    "The NutriPals gathered around the tree, eager to embark on an adventure through the Alimentary Alley, a magical pathway that led to the mysterious Castle Digestia.",
    "\n\r\nOne bright morning, the NutriPals set out on their journey.",
    "As they entered the Alimentary Alley, they encountered the Buccal Buddies, a group of animated teeth who loved to chew and break down the food particles.",
    "The NutriPals joined the Buccal Buddies in a dance of mastication, where they learned that digestion starts in the buccal cavity.",
    "\n\r\nContinuing their journey, the NutriPals reached the Stomach Square, where the Stomach Squad was busy secreting hydrochloric acid and digestive juices.",
    "The NutriPals witnessed the proteins getting broken down into simpler substances, and they marveled at the dance of the digestive juices.",
    "\n\r\nLeaving Stomach Square, the NutriPals entered the Intestinal Isles, a place filled with thousands of finger-like outgrowths known as Villi Villages.",
    "The NutriPals were amazed to see how these villi increased the surface area for absorption, allowing the digested food to enter the blood vessels.",
    "\n\r\nFurther down the Alimentary Alley, the NutriPals arrived at the Large Lagoon, where the Large Intestine Lakes absorbed water and salts from the undigested food.",
    "The remaining waste formed semi-solid faeces, ready for egestion.",
    "\n\r\nJust as the NutriPals thought their adventure was coming to an end, they encountered the Ruminant Rangers – cows, buffaloes, and deer – in the Rumen Realm.",
    "These friendly ruminants demonstrated the process of rumination, where they quickly ingested leafy food, stored it in the rumen, and later peacefully chewed the cud.",
    "\n\r\nFinally, the NutriPals reached the grand Castle Digestia, where the King Liver and Queen Pancreas ruled over the entire Nutri-verse.",
    "The royal couple shared the importance of their secretions – bile and pancreatic juice – in completing the digestion process.",
    "\n\r\nAs the NutriPals returned to Nutriville, they realized that their journey through the Alimentary Alley had not only been an exciting adventure but also an educational experience about the wonders of nutrition.",
    "Inspired, they decided to share their Nutri-verse story with others, creating flashcards filled with images of the Buccal Buddies, Stomach Squad, Villi Villages, Ruminant Rangers, and the royal Liver and Pancreas.",
    "\n\r\nAnd so, the NutriPals continued to spread knowledge and fun, making learning about nutrition a magical and unforgettable experience for all the inhabitants of Nutriville."
  ]
}